package main

import "fmt"

func main() {
	Task1()
}

// на ввод поадется целое число. Если число положительное - вывести сообщение  "число положительное", если число отрицательное - "число отрицательное". Если подается ноль - вывести сообщение "Ноль". Выводить сообщениебез кавычек
func Task1() {
	num := 11

	// Проверяем условия
	if num > 0 {
		fmt.Println("число положительное")
	} else if num < 0 {
		fmt.Println("число отрицательное")
	} else {
		fmt.Println("Ноль")
	}
}
//по данному трехзначному числу определите все ли его цифры различны. Формат входных данных на вход подается одно натуральное трехзначное число. Формат выходных данных Выведите "YES", если все цифры различны, в противном - "GO"
